Catalogs/МестаПримененияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МестаПримененияЭлементовКонструктораВидовПродукцииИС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МестаПримененияЭлементовКонструктораВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьМестаПримененияИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьМестаПримененияИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки)
	
	Идентификаторы      = ПараметрыЗагрузки.Идентификаторы;
	ДанныеКЗагрузке     = ДанныеКлассификатора.МестаПрименения;
	ИмяТаблицы          = Метаданные.Справочники.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя();
	КонфликтыОбновления = ПараметрыЗагрузки.КонфликтыОбновления;
	
	ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Наименование",               ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор",              ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеДляПодбора.Колонки.Добавить("Родитель",                   ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("Статус",                     ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("ХешСуммаПоставляемыхДанных", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеДляПодбора.Колонки.Добавить("Модифицирован",              Новый ОписаниеТипов("Булево"));
	
	ДанныеДляИерархии = Новый ТаблицаЗначений;
	ДанныеДляИерархии.Колонки.Добавить("Родитель", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для каждого СтрокаКЗагрузке Из ДанныеКЗагрузке Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляПодбора.Добавить(), СтрокаКЗагрузке);
		
		Если ЗначениеЗаполнено(СтрокаКЗагрузке.Родитель) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеДляИерархии.Добавить(), СтрокаКЗагрузке);
		КонецЕсли;
		
		ЕстьСвойствоМодифицирован = СтрокаКЗагрузке.Свойство("Модифицирован");
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляИерархии.Родитель КАК Родитель
		|ПОМЕСТИТЬ втДанныеДляИерархии
		|ИЗ
		|	&ДанныеДляИерархии КАК ДанныеДляИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляИерархии.Родитель КАК РодительНаименование,
		|	ЕСТЬNULL(ИерархияМестПрименения.Ссылка, НЕОПРЕДЕЛЕНО) КАК РодительСсылка
		|ИЗ
		|	втДанныеДляИерархии КАК втДанныеДляИерархии
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МестаПримененияЭлементовКонструктораВидовПродукцииИС.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС КАК МестаПримененияЭлементовКонструктораВидовПродукцииИС
		|		ГДЕ
		|			МестаПримененияЭлементовКонструктораВидовПродукцииИС.ЭтоГруппа = ИСТИНА) КАК ИерархияМестПрименения
		|		ПО втДанныеДляИерархии.Родитель = ИерархияМестПрименения.Ссылка.Наименование";
	Запрос.УстановитьПараметр("ДанныеДляИерархии", ДанныеДляИерархии);
	
	РезультатЗапроса = Запрос.Выполнить();
	СписокИерархии   = Новый Соответствие;
	
	ВыборкаПоИерархии = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПоИерархии.Следующий() Цикл
		Если ВыборкаПоИерархии.РодительСсылка <> Неопределено Тогда
			СуществующаяГруппа = ВыборкаПоИерархии.РодительСсылка;
		Иначе
			Если ПараметрыЗагрузки.ПолнаяЗагрузка Тогда
				СуществующаяГруппа = СоздатьГруппу();
				СуществующаяГруппа.Наименование = ВыборкаПоИерархии.РодительНаименование;
				СуществующаяГруппа.Записать();
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СписокИерархии.Вставить(ВыборкаПоИерархии.РодительНаименование, СуществующаяГруппа);
		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Наименование КАК Наименование,
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ДанныеДляПодбора.Родитель КАК Родитель,
		|	ДанныеДляПодбора.Статус КАК Статус,
		|	ДанныеДляПодбора.ХешСуммаПоставляемыхДанных КАК ХешСуммаЗагружаемыхДанных,
		|	ДанныеДляПодбора.Модифицирован КАК Модифицирован
		|
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Родитель КАК Родитель,
		|	втДанныеДляПодбора.Модифицирован КАК Модифицирован,
		|	МестаПрименения.Ссылка КАК СсылкаПоИдентификатору,
		|	МестаПрименения.ХешСумма КАК ХешСумма,
		|	МестаПрименения.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС КАК МестаПрименения
		|		ПО (МестаПрименения.Идентификатор = втДанныеДляПодбора.Идентификатор)
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Родитель КАК Родитель,
		|	втДанныеДляПодбора.Статус КАК Статус,
		|	втДанныеДляПодбора.ХешСуммаЗагружаемыхДанных КАК ХешСуммаЗагружаемыхДанных,
		|	втДанныеДляПодбора.Модифицирован КАК Модифицирован,
		|	МестаПрименения.Ссылка КАК СсылкаПоКлючевымПолям,
		|	МестаПрименения.ХешСумма КАК ХешСумма,
		|	МестаПрименения.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС КАК МестаПрименения
		|		ПО втДанныеДляПодбора.Наименование = МестаПрименения.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Наименование КАК Наименование,
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	втРезультатыПодбораПоКлючевымПолям.Родитель КАК Родитель,
		|	втРезультатыПодбораПоКлючевымПолям.Статус КАК Статус,
		|	втРезультатыПодбораПоКлючевымПолям.ХешСуммаЗагружаемыхДанных,
		|	втРезультатыПодбораПоКлючевымПолям.Модифицирован,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор
		|		И втРезультатыПодбораПоКлючевымПолям.Наименование = втРезультатыПодбораПоИдентификатору.Наименование";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
		СтрокаИдентификатора.Наименование  = ВыборкаДетальныеЗаписи.Наименование;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Родитель) Тогда
			СуществующаяГруппа = СписокИерархии.Получить(ВыборкаДетальныеЗаписи.Родитель);
			Если СуществующаяГруппа = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И ЕстьСвойствоМодифицирован Тогда
			Если Не ВыборкаДетальныеЗаписи.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка, ВыборкаДетальныеЗаписи.ХешСумма,
			ВыборкаДетальныеЗаписи.ХешСуммаПоставляемыхДанных, ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных);
		
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				ИмяТаблицы, ВыборкаДетальныеЗаписи.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;
		
		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();	
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;		
		КонецЕсли;
		
		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;
			СтруктураЗагружаемыхДанных  = ИнициализироватьПараметрыОбновления();

			ЗаполнитьЗначенияСвойств(СтруктураЗагружаемыхДанных, ВыборкаДетальныеЗаписи, , "ХешСуммаПоставляемыхДанных");

			СтруктураЗагружаемыхДанных.ХешСуммаПоставляемыхДанных = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;

			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка, СтруктураЗагружаемыхДанных);

		КонецЕсли;			
		
		Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, ВыборкаДетальныеЗаписи, , "Идентификатор,ХешСуммаПоставляемыхДанных");

			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
			КонецЕсли;

			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Родитель) Тогда
				СуществующийОбъект.Родитель = СуществующаяГруппа;
			КонецЕсли;

            Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				ВыборкаДетальныеЗаписи.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[ВыборкаДетальныеЗаписи.Статус];
            КонецЕсли;
            
			СуществующийОбъект.ХешСумма = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;

			Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
            	СуществующийОбъект.ХешСуммаПоставляемыхДанных = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;
			КонецЕсли;
			                        
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);

			СтрокаИдентификатора.Ссылка = СуществующийОбъект.Ссылка;

		КонецЕсли;

	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		ИдентификаторыПоТипу = Идентификаторы.Скопировать(Новый Структура("ИмяТаблицы", ИмяТаблицы), "Наименование,Идентификатор");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИдентификаторов.Наименование КАК Наименование,
		|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВтИдентификаторы
		|ИЗ
		|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.Ссылка КАК Ссылка,
		|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.Идентификатор КАК Идентификатор,
		|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.Наименование КАК Наименование
		|ИЗ
		|	Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС КАК МестаПримененияЭлементовКонструктораВидовПродукцииИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИдентификаторы КАК ВтИдентификаторы
		|		ПО МестаПримененияЭлементовКонструктораВидовПродукцииИС.Идентификатор = ВтИдентификаторы.Идентификатор
		|			И МестаПримененияЭлементовКонструктораВидовПродукцииИС.Наименование = ВтИдентификаторы.Наименование
		|ГДЕ
		|	ВтИдентификаторы.Наименование ЕСТЬ NULL
		|	И ВтИдентификаторы.Идентификатор ЕСТЬ NULL";
		Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ИдентификаторыПоТипу);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаИдентификатора = Идентификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, ВыборкаДетальныеЗаписи);
			
			СтрокаИдентификатора.ИмяТаблицы = ИмяТаблицы;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",               "");
	СтруктураДанныхОбновления.Вставить("Родитель",                   "");
	СтруктураДанныхОбновления.Вставить("Идентификатор",              "");
	СтруктураДанныхОбновления.Вставить("Статус",                     "");
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных", "");	

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
